---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.UnableToDetachGroup
source: html/da8c0d72-e9da-be67-86ea-4450459a73d0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.UnableToDetachGroup Property

Unable to detach the selected attached detail group(s).

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToDetachGroup { get; }
```